In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
arr = [1,2,3,4,5]
data_arr = np.array(arr)
alp = ['a','b','c','d','e']
d = {'a':1,'b':2,'c':3,'d':4,'e':5}

In [4]:
data_arr

array([1, 2, 3, 4, 5])

In [5]:
alp

['a', 'b', 'c', 'd', 'e']

In [6]:
d

{'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}

In [7]:
pd.Series(data=arr)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [10]:
pd.Series(data=arr,index=alp)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
import pandas as pd
pd.Series?

In [3]:
animals=['tiger','lion']
pd.Series(animals)

0    tiger
1     lion
dtype: object

In [3]:
animals = ['tiger','lion',None]
pd.Series(animals)

0    tiger
1     lion
2     None
dtype: object

In [3]:
import numpy as np
arr = np.array(['a','b','c','d','e'])
pd.Series(arr)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [5]:
np.nan = None
np.nan==np.nan

True

In [6]:
np.nan

In [7]:
print(np.nan)

None

In [10]:
np.nan = np.nan

In [6]:
s=  pd.Series(['tiger','bear','fox'],index=['India','Africa','South'])
s

India     tiger
Africa     bear
South       fox
dtype: object

In [7]:
s.index

Index(['India', 'Africa', 'South'], dtype='object')

In [9]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports,index=['Golf','Sumo','hockey'])

In [10]:
s

Golf      Scotland
Sumo         Japan
hockey         NaN
dtype: object

In [11]:

s.loc['Golf']

'Scotland'

In [14]:
s.iloc[1]

'Japan'

In [15]:
s[1]

'Japan'

In [16]:
sports = {99: 'Bhutan',
          100: 'Scotland',
          101: 'Japan',
          102: 'South Korea'}
s = pd.Series(sports)

In [21]:
s.loc[99]

'Bhutan'

In [22]:
s[99]

'Bhutan'

In [24]:
total =0 
for item in s:
    print(item)

Bhutan
Scotland
Japan
South Korea

In [25]:
import numpy as np
t = np.sum(s)

In [26]:
t

'BhutanScotlandJapanSouth Korea'

In [37]:
s=pd.Series(np.random.randint(0,10,5))
s

0    2
1    1
2    3
3    0
4    8
dtype: int64

In [38]:
len(s)

5

In [41]:
import pandas as pd
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1,purchase_2,purchase_3],index=['Store 1','Store 2','Store 3' ])
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 2  Kevyn   Kitty Litter   2.5
Store 3  Vinod      Bird Seed   5.0

In [42]:
df.loc['Store 2']

Name                     Kevyn
Item Purchased    Kitty Litter
Cost                       2.5
Name: Store 2, dtype: object

In [43]:
type(df.loc['Store 2'])

pandas.core.series.Series

In [44]:
df.loc['Store 1','Cost']

22.5

In [45]:
df.T

                 Store 1       Store 2    Store 3
Name               Chris         Kevyn      Vinod
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5          5

In [46]:
df.loc['Store 1','Cost']

22.5

In [47]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 2  Kevyn   Kitty Litter   2.5
Store 3  Vinod      Bird Seed   5.0

In [48]:
df['Cost']

Store 1    22.5
Store 2     2.5
Store 3     5.0
Name: Cost, dtype: float64

In [49]:
df.drop('Store 1')

          Name Item Purchased  Cost
Store 2  Kevyn   Kitty Litter   2.5
Store 3  Vinod      Bird Seed   5.0

In [50]:
df['Cost']

Store 1    22.5
Store 2     2.5
Store 3     5.0
Name: Cost, dtype: float64

In [51]:
cost = df['Cost']

In [52]:
cost+=2
cost

Store 1    24.5
Store 2     4.5
Store 3     7.0
Name: Cost, dtype: float64

In [53]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  24.5
Store 2  Kevyn   Kitty Litter   4.5
Store 3  Vinod      Bird Seed   7.0